In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [2]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)

In [3]:
pd.Series(data = my_data,index = labels)

a    10
b    20
c    30
dtype: int64

In [4]:
dict = {'Aneruth':'Belgium','Abishek':'Belgium','Adithya':'France'}

In [5]:
ser1 = pd.Series(dict)

In [6]:
ser1

Aneruth    Belgium
Abishek    Belgium
Adithya     France
dtype: object

In [7]:
ser1['Aneruth']

'Belgium'

In [8]:
ser2 = pd.Series(data=labels)

In [9]:
ser2

0    a
1    b
2    c
dtype: object

In [10]:
ser1 + ser2

0          NaN
1          NaN
2          NaN
Abishek    NaN
Adithya    NaN
Aneruth    NaN
dtype: object

In [11]:
data = [1,2,3,4,5]
data1 = [6,7,8,9,0]
ane = pd.Series(data=data)
ane1 = pd.Series(data=data1)
abc = ''
for i in range(0,1):
    if data == data1:
        abc = ane + ane1
        print(abc)
    # else:
    #     print('Nice Play')
print(abc)

In [12]:
########################Dataframes#######################

In [13]:
np.random.seed(100)

In [14]:
abi = pd.DataFrame(randn(4,3),['a','b','c','d'],['Ane','Abi','Adi'])
abi

        Ane       Abi       Adi
a -1.749765  0.342680  1.153036
b -0.252436  0.981321  0.514219
c  0.221180 -1.070043 -0.189496
d  0.255001 -0.458027  0.435163

In [15]:
abi['Ane']

a   -1.749765
b   -0.252436
c    0.221180
d    0.255001
Name: Ane, dtype: float64

In [16]:
type(abi['Ane'])

pandas.core.series.Series

In [17]:
abi.Abi

a    0.342680
b    0.981321
c   -1.070043
d   -0.458027
Name: Abi, dtype: float64

In [18]:
abi[['Abi','Ane']]

        Abi       Ane
a  0.342680 -1.749765
b  0.981321 -0.252436
c -1.070043  0.221180
d -0.458027  0.255001

In [19]:
# Creating a new column
abi['Aishu'] = abi['Abi'] + abi['Adi']
abi

        Ane       Abi       Adi     Aishu
a -1.749765  0.342680  1.153036  1.495716
b -0.252436  0.981321  0.514219  1.495540
c  0.221180 -1.070043 -0.189496 -1.259539
d  0.255001 -0.458027  0.435163 -0.022863

In [20]:
abi.drop('Aishu',axis=1)

        Ane       Abi       Adi
a -1.749765  0.342680  1.153036
b -0.252436  0.981321  0.514219
c  0.221180 -1.070043 -0.189496
d  0.255001 -0.458027  0.435163

In [21]:
abi

        Ane       Abi       Adi     Aishu
a -1.749765  0.342680  1.153036  1.495716
b -0.252436  0.981321  0.514219  1.495540
c  0.221180 -1.070043 -0.189496 -1.259539
d  0.255001 -0.458027  0.435163 -0.022863

In [22]:
abi

        Ane       Abi       Adi     Aishu
a -1.749765  0.342680  1.153036  1.495716
b -0.252436  0.981321  0.514219  1.495540
c  0.221180 -1.070043 -0.189496 -1.259539
d  0.255001 -0.458027  0.435163 -0.022863

In [23]:
# To remove the column in the main table 
abi.drop('Aishu',axis=1,inplace=True)

In [24]:
abi

        Ane       Abi       Adi
a -1.749765  0.342680  1.153036
b -0.252436  0.981321  0.514219
c  0.221180 -1.070043 -0.189496
d  0.255001 -0.458027  0.435163

In [25]:
# To drop a row(s)
abi.drop('d',inplace=True)

In [26]:
abi

        Ane       Abi       Adi
a -1.749765  0.342680  1.153036
b -0.252436  0.981321  0.514219
c  0.221180 -1.070043 -0.189496

In [27]:
abi.shape

(3, 3)

In [28]:
# To get the information of a particular row 
abi.loc[['a','b']]

        Ane       Abi       Adi
a -1.749765  0.342680  1.153036
b -0.252436  0.981321  0.514219

In [29]:
abi.iloc[[1]]

        Ane       Abi       Adi
b -0.252436  0.981321  0.514219

In [30]:
# to fetch a subset c row and 'Abi' col with value -1.070043
abi.iloc[[2],[1]]

        Abi
c -1.070043

In [31]:
abi.loc[['a','b'],['Ane','Adi']]

        Ane       Adi
a -1.749765  1.153036
b -0.252436  0.514219

In [32]:
df = pd.DataFrame(randn(5,4),['a','b','c','d','e'],['w','x','y','z'])

In [33]:
df

          w         x         y         z
a -0.583595  0.816847  0.672721 -0.104411
b -0.531280  1.029733 -0.438136 -1.118318
c  1.618982  1.541605 -0.251879 -0.842436
d  0.184519  0.937082  0.731000  1.361556
e -0.326238  0.055676  0.222400 -1.443217

In [34]:
# TO check the boolean value
booldf = df > 0
df[booldf]

          w         x         y         z
a       NaN  0.816847  0.672721       NaN
b       NaN  1.029733       NaN       NaN
c  1.618982  1.541605       NaN       NaN
d  0.184519  0.937082  0.731000  1.361556
e       NaN  0.055676  0.222400       NaN

In [35]:
print(df['w'] > 0)
print(df['w'])

a    False
b    False
c     True
d     True
e    False
Name: w, dtype: bool
a   -0.583595
b   -0.531280
c    1.618982
d    0.184519
e   -0.326238
Name: w, dtype: float64

In [36]:
#Return row which has true value
df[df['w']>0]

          w         x         y         z
c  1.618982  1.541605 -0.251879 -0.842436
d  0.184519  0.937082  0.731000  1.361556

In [37]:
# Grab all the rows where z is less than 0 
df[df['z'] < 0]

          w         x         y         z
a -0.583595  0.816847  0.672721 -0.104411
b -0.531280  1.029733 -0.438136 -1.118318
c  1.618982  1.541605 -0.251879 -0.842436
e -0.326238  0.055676  0.222400 -1.443217

In [38]:
# To grab a row form the table 
result = df[df['w']>0]
result[['w','x','z','y']]

          w         x         z         y
c  1.618982  1.541605 -0.842436 -0.251879
d  0.184519  0.937082  1.361556  0.731000

In [39]:
df

          w         x         y         z
a -0.583595  0.816847  0.672721 -0.104411
b -0.531280  1.029733 -0.438136 -1.118318
c  1.618982  1.541605 -0.251879 -0.842436
d  0.184519  0.937082  0.731000  1.361556
e -0.326238  0.055676  0.222400 -1.443217

In [40]:
# Creataion of new dataframe
list = pd.DataFrame(randn(4,6),['a','b','c','d'],['Q','W','E','R','T','Y'])

In [41]:
list

          Q         W         E         R         T         Y
a -0.756352  0.816454  0.750445 -0.455947  1.189622 -1.690617
b -1.356399 -1.232435 -0.544439 -0.668172  0.007315 -0.612939
c  1.299748 -1.733096 -0.983310  0.357508 -1.613579  1.470714
d -1.188018 -0.549746 -0.940046 -0.827932  0.108863  0.507810

In [42]:
res = list['W']>0

In [43]:
res

a     True
b    False
c    False
d    False
Name: W, dtype: bool

In [44]:
res1 = list[list['W']>0]
res1

          Q         W         E         R         T         Y
a -0.756352  0.816454  0.750445 -0.455947  1.189622 -1.690617

In [45]:
res2 = list[list['Q']!=0][['E','R','T']]
res2

          E         R         T
a  0.750445 -0.455947  1.189622
b -0.544439 -0.668172  0.007315
c -0.983310  0.357508 -1.613579
d -0.940046 -0.827932  0.108863

In [46]:
res3 = list[(list['W']>=0) | (list['R']>=1)]
res3

          Q         W         E         R         T         Y
a -0.756352  0.816454  0.750445 -0.455947  1.189622 -1.690617

In [47]:
list

          Q         W         E         R         T         Y
a -0.756352  0.816454  0.750445 -0.455947  1.189622 -1.690617
b -1.356399 -1.232435 -0.544439 -0.668172  0.007315 -0.612939
c  1.299748 -1.733096 -0.983310  0.357508 -1.613579  1.470714
d -1.188018 -0.549746 -0.940046 -0.827932  0.108863  0.507810

In [48]:
bool_list = list > 0
bool_list

       Q      W      E      R      T      Y
a  False   True   True  False   True  False
b  False  False  False  False   True  False
c   True  False  False   True  False   True
d  False  False  False  False   True   True

In [49]:
print(bool_list[['Q','W','E','R','T','Y']] <= 0)
print('\n')
print(list[['Q','W','E','R','T','Y']])

Q      W      E      R      T      Y
a   True  False  False   True  False   True
b   True   True   True   True  False   True
c  False   True   True  False   True  False
d   True   True   True   True  False  False


          Q         W         E         R         T         Y
a -0.756352  0.816454  0.750445 -0.455947  1.189622 -1.690617
b -1.356399 -1.232435 -0.544439 -0.668172  0.007315 -0.612939
c  1.299748 -1.733096 -0.983310  0.357508 -1.613579  1.470714
d -1.188018 -0.549746 -0.940046 -0.827932  0.108863  0.507810

In [50]:
list

          Q         W         E         R         T         Y
a -0.756352  0.816454  0.750445 -0.455947  1.189622 -1.690617
b -1.356399 -1.232435 -0.544439 -0.668172  0.007315 -0.612939
c  1.299748 -1.733096 -0.983310  0.357508 -1.613579  1.470714
d -1.188018 -0.549746 -0.940046 -0.827932  0.108863  0.507810

In [51]:
list2 = list ** 2 
list2

          Q         W         E         R         T         Y
a  0.572069  0.666597  0.563167  0.207888  1.415201  2.858185
b  1.839818  1.518895  0.296414  0.446453  0.000054  0.375694
c  1.689345  3.003620  0.966899  0.127812  2.603636  2.162999
d  1.411386  0.302221  0.883687  0.685472  0.011851  0.257871

In [52]:
bool_list1 = list[(list['W']<0) | (list['Q']>=1)]
# def func(list):
#     while bool_list1 is True:
#         if list1['W'] >= 0:
#             print(list1['Q'])
#         else:
#             print(list)

# func(bool_list1)
print(bool_list1)

Q         W         E         R         T         Y
b -1.356399 -1.232435 -0.544439 -0.668172  0.007315 -0.612939
c  1.299748 -1.733096 -0.983310  0.357508 -1.613579  1.470714
d -1.188018 -0.549746 -0.940046 -0.827932  0.108863  0.507810